tap "jlhonora/lsusb"
tap "koekeishiya/formulae"
tap "schpet/tap"
tap "sst/tap"
tap "thezoraiz/ascii-image-converter"
# ARP scanning and fingerprinting tool
brew "arp-scan"
# New way to see and navigate directory trees
brew "broot"
# CPU usage limiter
brew "cpulimit"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Convert images to PDF via direct JPEG inclusion
brew "img2pdf"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# List USB devices, just like the Linux lsusb command
brew "lsusb"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# PDF converter to SVG
brew "pdf2svg"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Paste PNG into files
brew "pngpaste"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Powerful free data recovery utility
brew "testdisk"
# Instant terminal sharing
brew "tmate"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line tool for sharing terminal over the web
brew "ttyd"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# CLI tool for linear.app that uses git branch names and directory names to open issues and team pages
brew "schpet/tap/linear"
# The AI coding agent built for the terminal.
brew "sst/tap/opencode", link: false
# Convert images into ascii art
brew "thezoraiz/ascii-image-converter/ascii-image-converter"
# Enable Windows-like alt-tab
cask "alt-tab"
# Terminal-based AI coding assistant
cask "claude-code"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Mount network shares quick and easy
cask "connectmenow"
# Web browser
cask "firefox@developer-edition"
cask "font-meslo-lg-nerd-font"
# Font viewer for various font formats
cask "fontgoggles"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Open-source screen recorder built with web technology
cask "kap"
# File system integration
cask "macfuse"
# Extensible two-pane file manager
cask "marta"
# Track your USB devices in the macOS menu bar
cask "mountmate"
# TouchBar customization app
cask "mtmr"
# System monitor for the menu bar
cask "stats"
vscode "ahmadawais.shades-of-purple"
vscode "anthropic.claude-code"
vscode "asvetliakov.vscode-neovim"
vscode "bradlc.vscode-tailwindcss"
vscode "byi8220.indented-block-highlighting"
vscode "chinchiheather.vscode-margin-colours"
vscode "cliffordfajardo.highlight-line-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "dnicolson.binary-plist"
vscode "drywolf.dark-plus-plus-theme"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-optimize-images"
vscode "fermelone.simple-browser-multi"
vscode "gantoreno.vscode-linear"
vscode "gerane.theme-dracula"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "jacobkucera.codepen-theme"
vscode "jock.svg"
vscode "kdcro101.favorites"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "mkxml.vscode-filesize"
vscode "mohd-akram.vscode-html-format"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "nextbook.file-and-folder-icons"
vscode "oderwat.indent-rainbow"
vscode "rifi2k.format-html-in-php"
vscode "ritwickdey.liveserver"
vscode "rodrigovallades.es7-react-js-snippets"
vscode "sakata.night-owl-colorful-html"
vscode "sanchitverma.block-comments"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shinotatwu-ds.file-tree-generator"
vscode "simonsiefke.svg-preview"
vscode "sirtori.indenticator"
vscode "sleistner.vscode-fileutils"
vscode "slevesque.shader"
vscode "taniarascia.new-moon-vscode"
vscode "teabyii.ayu"
vscode "the-e3n.block-highlighter"
vscode "thekalinga.bootstrap4-vscode"
vscode "tomoki1207.pdf"
vscode "visbydev.folder-path-color"
vscode "yzane.markdown-pdf"
vscode "zhuangtongfa.material-theme"
vscode "zimonitrome.color-blocks"
vscode "zitup.classnametocss"
