# ── Formulae ──────────────────────────────────────────────────────────────────

brew "arp-scan"    # ARP scanning and fingerprinting
brew "broot"       # Navigate directory trees
brew "ffmpeg"      # Play, record, convert, and stream audio/video
brew "imagemagick" # Manipulate images in many formats
brew "img2pdf"     # Convert images to PDF via direct JPEG inclusion
brew "jq"          # Command-line JSON processor
brew "neofetch"    # System info script
brew "neovim"      # Vim-fork focused on extensibility and agility
brew "nmap"        # Port scanning utility for large networks
brew "pdf2svg"     # PDF converter to SVG
brew "pipx"        # Run Python apps in isolated environments
brew "pngpaste"    # Paste PNG into files
brew "tmux"        # Terminal multiplexer
brew "tree"        # Display directories as trees
brew "yazi"        # Terminal file manager (async I/O, written in Rust)
brew "zellij"      # Pluggable terminal workspace

# ── Casks ─────────────────────────────────────────────────────────────────────

cask "claude-code"                 # Terminal-based AI coding assistant
cask "firefox@developer-edition"   # Web browser
cask "font-meslo-lg-nerd-font"     # Nerd Font
cask "fontgoggles"                 # Font viewer for various font formats
cask "kap"                         # Open-source screen recorder
cask "macfuse"                     # File system integration
cask "marta"                       # Extensible two-pane file manager

# ── VS Code Extensions ────────────────────────────────────────────────────────

vscode "ahmadawais.shades-of-purple"
vscode "bradlc.vscode-tailwindcss"
vscode "esbenp.prettier-vscode"
vscode "oderwat.indent-rainbow"