[
  "table-editor-obsidian",
  "code-styler",
  "obsidian-csv-table",
  "multi-column-markdown",
  "obsidian-image-gallery",
  "templater-obsidian",
  "folder-notes",
  "terminal",
  "dataview",
  "kol-dashboard",
  "copy-url-in-preview",
  "obsidian-image-toolkit",
  "obsidian42-brat",
  "obsidian-kanban",
  "ai-image-analyzer",
  "obsidian-react-components",
  "typewriter-mode",
  "feed-bases",
  "obsidian-theme-design-utilities",
  "wordcraft",
  "obsidian-columns",
  "obsidian-outliner",
  "better-export-pdf",
  "dynamic-outline",
  "wikipedia-search",
  "calendar",
  "periodic-notes",
  "pixel-perfect-image",
  "markdown-shortcuts",
  "tag-wrangler",
  "obsidian-collapse-all-plugin"
]