ahmadawais.shades-of-purple
anthropic.claude-code
asvetliakov.vscode-neovim
bradlc.vscode-tailwindcss
byi8220.indented-block-highlighting
chinchiheather.vscode-margin-colours
cliffordfajardo.highlight-line-vscode
dbaeumer.vscode-eslint
dnicolson.binary-plist
drywolf.dark-plus-plus-theme
enkia.tokyo-night
esbenp.prettier-vscode
fabiospampinato.vscode-optimize-images
fermelone.simple-browser-multi
gantoreno.vscode-linear
gerane.theme-dracula
github.copilot
github.copilot-chat
jacobkucera.codepen-theme
jock.svg
kdcro101.favorites
mechatroner.rainbow-csv
mgmcdermott.vscode-language-babel
mkxml.vscode-filesize
mohd-akram.vscode-html-format
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.live-server
ms-vscode.remote-explorer
nextbook.file-and-folder-icons
oderwat.indent-rainbow
rifi2k.format-html-in-php
ritwickdey.liveserver
rodrigovallades.es7-react-js-snippets
sakata.night-owl-colorful-html
sanchitverma.block-comments
shd101wyy.markdown-preview-enhanced
shinotatwu-ds.file-tree-generator
simonsiefke.svg-preview
sirtori.indenticator
sleistner.vscode-fileutils
slevesque.shader
taniarascia.new-moon-vscode
teabyii.ayu
the-e3n.block-highlighter
thekalinga.bootstrap4-vscode
tomoki1207.pdf
visbydev.folder-path-color
yzane.markdown-pdf
zhuangtongfa.material-theme
zimonitrome.color-blocks
zitup.classnametocss
