[
  "table-editor-obsidian",
  "calendar",
  "obsidian-icon-folder",
  "obsidian-file-color",
  "colored-tags",
  "file-explorer-note-count",
  "file-explorer-plus",
  "omnisearch",
  "cmdr",
  "mlir-syntax-highlight",
  "code-styler",
  "tag-wrangler",
  "frontmatter-modified-date",
  "obsidian-csv-table",
  "any-block",
  "multi-column-markdown",
  "obsidian-collapse-all-plugin",
  "obsidian-image-gallery",
  "obsidian-linter",
  "obsidian-state-switcher",
  "file-manager",
  "quick-explorer",
  "obsidian-advanced-uri",
  "dataview"
]